Repository: LynxLynxx/Carlog
Catalog: lib/l10n/intl_*.arb
Languages: es, pl

source: Login
es: Iniciar sesión
pl: Logowanie

source: OR
es: O
pl: LUB

source: Register
es: Registrarse
pl: Rejestracja

source: Remind password
es: Recordar contraseña
pl: Przypomnij hasło

source: Email
es: Correo electrónico

source: Password
es: Contraseña
pl: Hasło

source: Password recovery
es: Recuperación de contraseña
pl: Odzyskiwanie hasła

source: Notifications
es: Notificaciones
pl: Powiadomienia

source: Analytics
es: Análisis
pl: Analityka

source: Electric cars
es: Coches eléctricos
pl: Samochody elektryczne

# bodyReciveNotifications
source: Receive notifications about upcoming services and planned repairs!
es: ¡Recibe notificaciones sobre los próximos servicios y reparaciones programadas!
pl: Otrzymuj powiadomienia o nadchodzących serwisach i planowanych naprawach!

# bodyAnalyticsTutorial
source: Have access to preview statistics on car expenses!
es: ¡Accede a una vista previa de las estadísticas de gastos de tu coche!
pl: Uzyskaj dostęp do szczegółowych statystyk wydatków na samochód!

# bodyElectricCarsTutorial
source: Are you getting an electric car? We support them too!
es: ¿Tienes un coche eléctrico? ¡También los apoyamos!
pl: Posiadasz samochód elektryczny? My również go wspieramy!

source: Next
es: Siguiente
pl: Dalej

source: Get Started
es: Empezar
pl: Rozpocznij

# welocomeBack
source: Welcome Back!
es: ¡Bienvenido de nuevo!
pl: Witamy ponownie!

source: Create Account!
es: ¡Crea una cuenta!
pl: Utwórz konto!

# errorAccountExists
source: Account exists with different credentials
es: Ya existe una cuenta con diferentes credenciales.
pl: Konto istnieje z innymi poświadczeniami

# errorInvalidCredential
source: The credential received are invalid
es: Las credenciales recibidas no son válidas.
pl: Otrzymane poświadczenia są nieprawidłowe

# errorOperationNotAllowed
source: Operation is not allowed. Please contact support
es: La operación no está permitida. Por favor, contacta con el soporte técnico.
pl: Operacja jest niedozwolona. Skontaktuj się z pomocą techniczną

# errorUserDisabled
source: The user as beddn disabled. Please contact support for help
es: El usuario se ha desactivado. Por favor, contacta con el soporte técnico para obtener ayuda.
pl: Użytkownik został wyłączony. Skontaktuj się z pomocą techniczną w celu uzyskania pomocy

# errorUserNotFound
source: User with this credentials does not exists
es: No existe un usuario con estas credenciales.
pl: Użytkownik z tymi poświadczeniami nie istnieje

# errorInvalidVerificationCode
source: The verification code is invalid
es: El código de verificación no es válido.
pl: Kod weryfikacyjny jest nieprawidłowy

# errorInvalidCerificationId
source: The verification id is invalid
es: El ID de verificación no es válido.
pl: Identyfikator weryfikacji jest nieprawidłowy

# errorInvalidEmail
source: Email is not valid or badly formatted
es: El correo electrónico no es válido o está mal formateado.
pl: Email jest nieprawidłowy lub ma zły format

# errorEmailInUse
source: Account already exists
es: La cuenta ya existe.
pl: Konto już istnieje

# errorWeakPassword
source: Please eneter a stronger password
es: Por favor, introduce una contraseña más segura.
pl: Podaj silniejsze hasło

# errorAborted
source: The operation was aborted
es: La operación se ha cancelado.
pl: Operacja została przerwana

# errorAlreadyExists
source: This data already exists
es: Estos datos ya existen.
pl: Te dane już istnieją

# errorCancled
source: The operation was cancelled
es: La operación se ha cancelado.
pl: Operacja została anulowana

# errorDataLoss
source: Your data was lost or corrupted
es: Tus datos se han perdido o corrompido.
pl: Twoje dane zostały utracone lub uszkodzone

# errorDeadlineExceeded
source: Operation couldn''t be completed
es: No se ha podido completar la operación.
pl: Operacji nie można ukończyć

# errorFailedPrecondition
source: Operation was rejected, because system couldn''t procced with execution
es: La operación se ha rechazado porque el sistema no ha podido continuar con la ejecución.
pl: Operacja została odrzucona, ponieważ system nie mógł kontynuować wykonania

# errorInternal
source: Internal error occoured. Please try again later
es: Se ha producido un error interno. Por favor, inténtalo de nuevo más tarde.
pl: Wystąpił błąd wewnętrzny. Spróbuj ponownie później

# errorInvalidArgument
source: Invalid arguemnt was specified
es: Se ha especificado un argumento no válido.
pl: Podano nieprawidłowy argument

# errorNotFound
source: Requested document was not found
es: El documento solicitado no se ha encontrado.
pl: Żądany dokument nie został znaleziony

# errorOutOfRange
source: Operation was attempted past the valid range
es: Se ha intentado realizar una operación fuera del rango válido.
pl: Próba operacji poza prawidłowym zakresem

# errorResourceExhausted
source: Resources are not available at this time. Try again later
es: Los recursos no están disponibles en este momento. Inténtalo de nuevo más tarde.
pl: Zasoby nie są obecnie dostępne. Spróbuj ponownie później

# errorUnauthenticated
source: You don''t have permission to perform this operation
es: No tienes permiso para realizar esta operación.
pl: Nie masz uprawnień do wykonania tej operacji

# errorUnavailable
source: The service is currently unavailable
es: El servicio no está disponible actualmente.
pl: Usługa jest obecnie niedostępna

# errorUnimplemented
source: Operation is not implemented or not supported
es: La operación no está implementada o no es compatible.
pl: Operacja nie jest zrealizowana lub nie jest obsługiwana

# errorUnknown
source: Unkown error occurred
es: Se ha producido un error desconocido.
pl: Wystąpił nieznany błąd

# carBrandValidator
source: The vehicle brand name should be between 2 and 20 characters
es: El nombre de la marca del vehículo debe tener entre 2 y 20 caracteres
pl: Nazwa marki pojazdu powinna zawierać od 2 do 20 znaków.

# carModelValidator
source: The vehicle model name should be between 1 and 30 characters
es: El nombre del modelo del vehículo debe tener entre 1 y 30 caracteres
pl: Nazwa modelu pojazdu powinna zawierać od 1 do 30 znaków.

# carYearValidator
source: The vehicle year of manufacture should be 4 characters
es: El año de fabricación del vehículo debe tener 4 caracteres
pl: Rok produkcji pojazdu powinien zawierać 4 znaki.

# carPlateValidator
source: The vehicle plate should be between 1 and 15 characters
es: La matrícula del vehículo debe tener entre 1 y 15 caracteres
pl: Numer rejestracyjny pojazdu powinien zawierać od 1 do 15 znaków.

# engineCapacityValidator
source: The engine capacity should be between 1 and 7 digits
es: La cilindrada del motor debe tener entre 1 y 7 dígitos
pl: Pojemność silnika powinna zawierać od 1 do 7 cyfr.

# enginePowerValidator
source: The engine power should be between 1 and 4 digits
es: La potencia del motor debe tener entre 1 y 4 dígitos
pl: Moc silnika powinna zawierać od 1 do 4 cyfr.

source: Successfully added the vehicle
es: Vehículo añadido correctamente
pl: Pojazd został pomyślnie dodany.

source: Successfully edited the vehicle
es: Vehículo editado correctamente
pl: Pojazd został pomyślnie edytowany.

source: Successfully deleted the vehicle
es: Vehículo eliminado correctamente
pl: Pojazd został pomyślnie usunięty.

source: Add Car
es: Añadir coche
pl: Dodaj samochód

source: Update Car
es: Actualizar coche
pl: Aktualizuj samochód

# deleteVehicleConfirmation
source: Are you sure you want to delete this vehicle?
es: ¿Está seguro de que desea eliminar este vehículo?
pl: Czy na pewno chcesz usunąć ten pojazd?

# litersValidator
source: Liters should be between 1 and 4 digits
es: Los litros deben tener entre 1 y 4 dígitos
pl: Pojemność w litrach powinna zawierać od 1 do 4 cyfr.

# priceValidator
source: Price should be between 1 and 5 digits
es: El precio debe tener entre 1 y 5 dígitos
pl: Cena powinna zawierać od 1 do 5 cyfr.

# milageValidator
source: Milage should be between 1 and 8 digits
es: El kilometraje debe tener entre 1 y 8 dígitos
pl: Przebieg powinien zawierać od 1 do 8 cyfr.

# pricePerLiterValidator
source: Price should be between 1 and 8 digits
es: El precio debe tener entre 1 y 8 dígitos
pl: Cena powinna zawierać od 1 do 8 cyfr.

source: Cars
es: Coches
pl: Samochody

source: Congratulations!
es: ¡Felicidades!
pl: Gratulacje!

source: You have successfully created your car!
es: ¡Ha creado su coche con éxito!
pl: Pomyślnie utworzyłeś swój samochód!

source: Unable to locate your brand?
es: ¿No encuentra su marca?
pl: Nie możesz znaleźć swojej marki?

source: Enter it manually!
es: ¡Introdúzcalo manualmente!
pl: Wpisz ją ręcznie!

source: Car Brand
es: Marca del coche
pl: Marka samochodu

source: e.g. Volvo
es: p. ej. Volvo
pl: np. Volvo

source: Year of production
es: Año de producción
pl: Rok produkcji

source: e.g. 2024
es: p. ej. 2024
pl: np. 2024

source: Milage
es: Kilometraje
pl: Przebieg

source: e.g. 10 000
es: p. ej. 10 000
pl: np. 10 000

source: Plate
es: Matrícula
pl: Numer rejestracyjny

source: e.g. AUM 550
es: p. ej. AUM 550
pl: np. AUM 550

source: Unable to locate your model?
es: ¿No encuentra su modelo?
pl: Nie możesz znaleźć swojego modelu?

source: Car Model
es: Modelo del coche
pl: Model samochodu

source: e.g. XC90
es: p. ej. XC90
pl: np. XC90

source: Type
es: Tipo
pl: Typ

source: e.g. SUV
es: p. ej. SUV
pl: np. SUV

source: Fuel Type
es: Tipo de combustible
pl: Rodzaj paliwa

source: e.g. Hybrid
es: p. ej. Híbrido
pl: np. Hybrid

source: Engine Capacity
es: Cilindrada del motor
pl: Pojemność silnika

source: e.g. 1984
es: p. ej. 1984
pl: np. 1984

source: Engine Power
es: Potencia del motor
pl: Moc silnika

source: e.g. 163
es: p. ej. 163
pl: np. 163

source: Skip
es: Omitir
pl: Pomiń

# youHaveNoCarsYet
source: You have no cars yet, add one!
es: Aún no tienes autos, ¡agrega uno!
pl: Nie masz jeszcze żadnych samochodów, dodaj jeden!

source: Today
es: Hoy
pl: Dzisiaj

# youDontHaveAnPlannedActivity
source: You donâ€™t have an planned activity yet.
es: Todavía no tienes una actividad planificada.
pl: Nie masz jeszcze zaplanowanej aktywności.

# coordinatesValidator
source: Coordinates should be between 1 and 25 characters
es: Las coordenadas deben tener entre 1 y 25 caracteres
pl: Współrzędne powinny zawierać od 1 do 25 znaków

# addressValidator
source: Address should be between 1 and 100 characters
es: La dirección debe tener entre 1 y 100 caracteres
pl: Adres powinien zawierać od 1 do 100 znaków

source: Successfully added the activity
es: Actividad agregada correctamente
pl: Aktywność dodana pomyślnie

source: e.g. Service
es: p. ej. Servicio
pl: np. Serwis

# egWalkway
source: e.g. Walkway, 10004, NY, United States
es: p. ej. Pasarela, 10004, NY, Estados Unidos
pl: np. Aleja, 10004, Nowy Jork, Stany Zjednoczone

source: Address
es: Dirección
pl: Adres

source: Add Action
es: Agregar acción
pl: Dodaj działanie

source: Date
es: Fecha
pl: Data

source: e.g. 2024-01-01
es: p. ej. 2024-01-01
pl: np. 2024-01-01

source: Update Milage
es: Actualizar kilometraje
pl: Aktualizuj przebieg

source: Successfully updated the milage
es: Kilometraje actualizado correctamente
pl: Przebieg zaktualizowany pomyślnie

source: ACCOUNT
es: CUENTA
pl: KONTO

source: My Account
es: Mi cuenta
pl: Moje konto

source: Change Password
es: Cambiar contraseña
pl: Zmień hasło

source: Log Out
es: Cerrar sesión
pl: Wyloguj się

source: CUSTOMIZE
es: PERSONALIZAR
pl: DOSTOSUJ

source: Language
es: Idioma
pl: Język

source: Color Theme
es: Tema de color
pl: Motyw kolorystyczny

source: Region/Country
es: Región/País
pl: Region/Kraj

source: PERMISSIONS
es: PERMISOS
pl: UPRAWNIENIA

source: Push Notifications
es: Notificaciones push
pl: Powiadomienia push

source: Library
es: Biblioteca
pl: Biblioteka

source: FEEDBACK
es: RETROALIMENTACIÓN
pl: OPINIE

source: Request New Feature
es: Solicitar nueva función
pl: Poproś o nową funkcję

source: Report Problem
es: Reportar problema
pl: Zgłoś problem

source: LEGAL INFORMATION
es: INFORMACIÓN LEGAL
pl: INFORMACJE PRAWNE

source: Privacy Policy
es: Política de privacidad
pl: Polityka prywatności

source: Terms of Use
es: Términos de uso
pl: Warunki korzystania

source: Settings
es: Configuración
pl: Ustawienia

# supportedLanguage
source: {language, select, pl{Polish} en{English} other{Spanish}}
es: {language, select, pl{Polaco} en{Inglés} other{Español}}
pl: {language, select, en{angielski} es{hiszpański} pl{polski} other{hiszpański}}

# supportedThemes
source: {theme, select, light{light} other{dark}}
es: {theme, select, light{claro} other{oscuro}}
pl: {theme, select, dark{ciemny} light{jasny} other{ciemny}}

# name
source: First name
es: Nombre
pl: Imię

source: Last name
es: Apellido
pl: Nazwisko

source: Save
es: Guardar
pl: Zapisz

# notValidEmpty
source: Filed cannot be empty
es: El campo no puede estar vacío
pl: Pole nie może być puste

source: Information
es: Información
pl: Informacje

# tapOnTheMap
source: Tap on the map to set the location of the action.
es: Toca en el mapa para establecer la ubicación de la acción.
pl: Naciśnij na mapie, aby ustawić lokalizację akcji.

# manageActions
source: Manage Action
es: Administrar acciones
pl: Zarządzaj działaniami

# noteValidator
source: Note should be between 2 and 100 characters
es: La nota debe tener entre 2 y 100 caracteres.
pl: Notatka powinna mieć od 2 do 100 znaków

source: Note
es: Nota
pl: Notatka

source: e.g. Remember to change the oil
es: Ejemplo: Recuerda cambiar el aceite.
pl: np. Pamiętaj o wymianie oleju

source: Service
es: Servicio
pl: Usługa

source: Oil Change
es: Cambio de aceite
pl: Wymiana oleju

source: Tire Change
es: Cambio de neumáticos
pl: Wymiana opon

source: Insurance
es: Seguro
pl: Ubezpieczenie

source: Action
es: Acción
pl: Akcja

source: Expense
es: Gasto
pl: Wydatek

source: Service Fee
es: Tarifa de servicio
pl: Opłata za usługę

source: Tires
es: Neumáticos
pl: Opony

source: Road Fee
es: Peaje
pl: Opłata drogowa

source: Insurance Fee
es: Cuota de seguro
pl: Opłata za ubezpieczenie

source: Car Wash
es: Lavado de coche
pl: Myjnia samochodowa

source: Parking Fee
es: Tarifa de aparcamiento
pl: Opłata parkingowa

source: Other
es: Otro
pl: Inne

source: Amount
es: Cantidad
pl: Kwota

source: e.g. 100
es: p. ej. 100
pl: np. 100

source: e.g. Oil filter replacement included
es: p. ej. Reemplazo de filtro de aceite incluido
pl: np. wymiana filtra oleju wliczona

source: e.g. Euro
es: p. ej. Euro
pl: np. Euro

source: Current password
es: Contraseña actual
pl: Hasło bieżące

source: New password
es: Nueva contraseña
pl: Nowe hasło

# repeatPassword
source: Repeat new password
es: Repetir la nueva contraseña
pl: Powtórz nowe hasło

source: About
es: Acerca de
pl: O aplikacji

# aboutApp
source: About the app
es: Acerca de la aplicación
pl: O aplikacji

source: Contact Us
es: Contáctanos
pl: Skontaktuj się z nami

# aboutUsDescription
source: The Carlog application was created by RS Apps, which has been on the market since 2023 and has cooperated with several companies. If you are interested in cooperation, contact us.
es: La aplicación Carlog fue creada por RS Apps, que ha estado en el mercado desde 2023 y ha cooperado con varias empresas. Si está interesado en la cooperación, contáctenos.
pl: Aplikacja Carlog została stworzona przez RS Apps, które od 2023 roku jest na rynku i współpracowało z kilkoma firmami. Jeśli jesteś zainteresowany współpracą, skontaktuj się z nami.

source: Main Developers
es: Desarrolladores principales
pl: Główni deweloperzy

# leadDeveloper
source: Lead Mobile Developer
es: Desarrollador móvil principal

# developer
source: Mobile Developer
es: Desarrollador móvil

source: Send Email
es: Enviar correo electrónico
pl: Wyślij E-mail

source: Visit Website
es: Visitar sitio web
pl: Strona

source: Cancel
es: Cancelar
pl: Anuluj

# deleteAcount
source: Delete Account
es: Eliminar cuenta
pl: Usuń konto

source: Delete Data
es: Borrar datos
pl: Usuń dane
